In [22]:
import pandas as pd
import numpy as np

In [20]:
dic = {'one 1':[1, 2, 3], 'two 2':[4, 5, 6], 'three 3':[7, 8, 9], 'four 4':[10, 11, 12], 'five 5':[13, 14, 15]}
x = pd.DataFrame(dic)

In [25]:
x
x.columns.sort_values()

Index(['five 5', 'four 4', 'one 1', 'three 3', 'two 2'], dtype='object')

In [28]:
pd.Series(x.columns).apply(len).max()

7

In [12]:
print(obj)
print(obj.name)
print(obj.shape)
print(obj.dtypes)
print(obj.ndim)
print(obj.size)
print(obj.axes)
print(obj.empty)
print(obj.index)
print(obj.values)

   one  two  three  four  five
0    1    4      7    10    13
1    2    5      8    11    14
2    3    6      9    12    15

AttributeError: 'DataFrame' object has no attribute 'name'

In [15]:
obj = pd.Series([0.1,0.25,0.5,0.75,1])
print(obj)
obj.empty

0    0.10
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

False

In [16]:
obj = pd.Series(index=['a','b','c'])
print(obj)
obj.empty

a   NaN
b   NaN
c   NaN
dtype: float64

C:\Users\kangwook.lee\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

False

In [17]:
obj = pd.Series()
print(obj)
obj.empty

Series([], dtype: float64)

C:\Users\kangwook.lee\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

True

In [27]:
print(pd.Series(),'\n')
print(pd.Series(np.random.randn(5),index=['a','b','c','d','e']),'\n')
print(pd.Series(np.random.randn(5)))

Series([], dtype: float64)

a   -0.936380
b   -1.407219
c    0.657215
d    0.664680
e    0.053192
dtype: float64

0    1.700139
1   -2.012707
2   -0.409736
3    0.676411
4   -1.495112
dtype: float64

C:\Users\kangwook.lee\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [28]:
d = {'b':1,'a':0,'c':2}
print(pd.Series(d),'\n')
d = {'a':0,'b':1,'c':2}
print(pd.Series(d),'\n')
print(pd.Series(d,index=['b','c','d','a']),'\n')

b    1
a    0
c    2
dtype: int64

a    0
b    1
c    2
dtype: int64

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [30]:
print(pd.Series(5, index=['a','b','c','d','e']))

a    5
b    5
c    5
d    5
e    5
dtype: int64

In [35]:
dic = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5}
obj = pd.Series(dic, name='dic')
print(obj[0],'\n')
print(obj[:3])
print(obj.mean())
print(obj[obj > obj.mean()])
print(obj[[3,2,1]])
print(np.exp(obj))

1

one      1
two      2
three    3
Name: dic, dtype: int64
3.0
four    4
five    5
Name: dic, dtype: int64
four     4
three    3
two      2
Name: dic, dtype: int64
one        2.718282
two        7.389056
three     20.085537
four      54.598150
five     148.413159
Name: dic, dtype: float64

In [36]:
dic = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5}
obj = pd.Series(dic, name='dic')
print(obj)
print(obj['three'])
obj['three'] = 33
print(obj['three'])

one      1
two      2
three    3
four     4
five     5
Name: dic, dtype: int64
3
33

In [37]:
'three' in obj

True

In [38]:
'six' in obj

False

In [39]:
obj.get('six',6)

6

In [41]:
obj['six'] = obj.get('six',6)
obj['six']

6

In [42]:
obj['two':'five']

two       2
three    33
four      4
five      5
Name: dic, dtype: int64

In [43]:
obj['five':'one']

Series([], Name: dic, dtype: int64)

In [44]:
obj.at

In [47]:
obj.at['two']

2

In [48]:
obj.iat[2]

33

In [49]:
obj.loc['four':]

four    4
five    5
six     6
Name: dic, dtype: int64

In [50]:
obj.iloc[4:]

five    5
six     6
Name: dic, dtype: int64

In [52]:
obj.get('two')

2

In [53]:
obj.get(2)

33

In [54]:
print(obj.get('six'))
print(obj.get('six',7))

6
6

In [56]:
obj.items()

In [57]:
list(obj.items())

[('one', 1), ('two', 2), ('three', 33), ('four', 4), ('five', 5), ('six', 6)]

In [60]:
tuple(obj.items())

(('one', 1), ('two', 2), ('three', 33), ('four', 4), ('five', 5), ('six', 6))

In [61]:
dict(obj.items())

{'one': 1, 'two': 2, 'three': 33, 'four': 4, 'five': 5, 'six': 6}

In [62]:
[(k,v) for k, v in obj.items()]

[('one', 1), ('two', 2), ('three', 33), ('four', 4), ('five', 5), ('six', 6)]

In [63]:
obj.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [64]:
type(obj.index)

pandas.core.indexes.base.Index

In [65]:
obj.keys()

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [66]:
type(obj.keys())

pandas.core.indexes.base.Index

In [67]:
obj.tolist()

[1, 2, 33, 4, 5, 6]

In [68]:
obj.to_dict()

{'one': 1, 'two': 2, 'three': 33, 'four': 4, 'five': 5, 'six': 6}

In [69]:
obj.to_json()

'{"one":1,"two":2,"three":33,"four":4,"five":5,"six":6}'

In [70]:
obj.replace(33,3, inplace=True)
obj

one      1
two      2
three    3
four     4
five     5
six      6
Name: dic, dtype: int64

In [71]:
obj.replace(3,33, inplace=True)
obj

one       1
two       2
three    33
four      4
five      5
six       6
Name: dic, dtype: int64

In [73]:
obj['one':'three'].replace(33,3, inplace=True)
obj

one      1
two      2
three    3
four     4
five     5
six      6
Name: dic, dtype: int64

In [74]:
dic = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5}
obj = pd.Series(dic, name='dic')
print(obj)

one      1
two      2
three    3
four     4
five     5
Name: dic, dtype: int64

In [75]:
obj.sort_values()

one      1
two      2
three    3
four     4
five     5
Name: dic, dtype: int64

In [77]:
print(obj.sort_values(ascending=False))
print(obj)
obj.sort_values(ascending=False,inplace=True)
print(obj)

five     5
four     4
three    3
two      2
one      1
Name: dic, dtype: int64
one      1
two      2
three    3
four     4
five     5
Name: dic, dtype: int64
five     5
four     4
three    3
two      2
one      1
Name: dic, dtype: int64

In [78]:
obj.sort_index(ascending=False)

two      2
three    3
one      1
four     4
five     5
Name: dic, dtype: int64

In [79]:
dic = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5}
obj = pd.Series(dic, name='dic')
print(obj)
print(obj+1)
print(obj-1)
print(obj*2)
print(obj/2)
print(obj//2)
print(obj%2)

one      1
two      2
three    3
four     4
five     5
Name: dic, dtype: int64
one      2
two      3
three    4
four     5
five     6
Name: dic, dtype: int64
one      0
two      1
three    2
four     3
five     4
Name: dic, dtype: int64
one       2
two       4
three     6
four      8
five     10
Name: dic, dtype: int64
one      0.5
two      1.0
three    1.5
four     2.0
five     2.5
Name: dic, dtype: float64
one      0
two      1
three    1
four     2
five     2
Name: dic, dtype: int64
one      1
two      0
three    1
four     0
five     1
Name: dic, dtype: int64

In [82]:
obj1 = pd.Series([1,2,3,4,5])
obj2 = pd.Series([6,7,8,9,])
print(obj1.size)
print(obj2.size)
print(obj1+obj2)
print(obj1-obj2)

5
4
0     7.0
1     9.0
2    11.0
3    13.0
4     NaN
dtype: float64
0   -5.0
1   -5.0
2   -5.0
3   -5.0
4    NaN
dtype: float64

In [86]:
a = pd.Series([1,1,1, np.nan],index=['a','b','c','d'])
a

a    1.0
b    1.0
c    1.0
d    NaN
dtype: float64

In [88]:
b = pd.Series([1,np.nan,1,np.nan],index=['a','b','c','d'])
b

a    1.0
b    NaN
c    1.0
d    NaN
dtype: float64

In [89]:
a.add(b)

a    2.0
b    NaN
c    2.0
d    NaN
dtype: float64

In [90]:
a.add(b,fill_value=0)

a    2.0
b    1.0
c    2.0
d    NaN
dtype: float64

In [91]:
a.sub(b,fill_value=0)

a    0.0
b    1.0
c    0.0
d    NaN
dtype: float64

In [92]:
a.mul(b,fill_value=0)

a    1.0
b    0.0
c    1.0
d    NaN
dtype: float64

In [93]:
a.div(b, fill_value=0)

a    1.0
b    inf
c    1.0
d    NaN
dtype: float64

In [94]:
a = pd.Series([1,1,1, np.nan],index=['a','b','c','d'])
a

a    1.0
b    1.0
c    1.0
d    NaN
dtype: float64

In [95]:
b = pd.Series([1,np.nan,1,np.nan],index=['a','b','c','d'])
b

a    1.0
b    NaN
c    1.0
d    NaN
dtype: float64

In [96]:
a.append(b)

a    1.0
b    1.0
c    1.0
d    NaN
a    1.0
b    NaN
c    1.0
d    NaN
dtype: float64

In [ ]:
a.append(b, verify_integrity=True)

In [100]:
rndint = np.random.randint(10,size=5)
rndint

array([7, 8, 9, 9, 7])

In [101]:
obj = pd.Series(rndint)
obj

0    7
1    8
2    9
3    9
4    7
dtype: int32

In [102]:
obj2 = pd.Series(index=set(rndint))

C:\Users\kangwook.lee\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [103]:
obj2

8   NaN
9   NaN
7   NaN
dtype: float64

In [105]:
obj.mode()

9

In [106]:
obj.count()

5

In [107]:
obj2.count()

0

In [108]:
rndint = np.random.randn(5)
obj = pd.Series(rndint)
obj

0    0.702346
1    0.721519
2    0.444031
3   -1.033584
4   -0.202021
dtype: float64

In [109]:
obj.mean()

0.12645830700743296

In [110]:
obj.sum()

0.6322915350371648

In [111]:
obj.sum()/len(obj)

0.12645830700743296

In [112]:
obj.std()

0.7483638909821481

In [117]:
np.sqrt(((obj - obj.mean())**2).sum()/(len(obj)-1))

0.7483638909821481

In [118]:
obj.var()

0.5600485133259404

In [119]:
obj.describe()

count    5.000000
mean     0.126458
std      0.748364
min     -1.033584
25%     -0.202021
50%      0.444031
75%      0.702346
max      0.721519
dtype: float64

In [122]:
sentence = list('Good morning Welcome to Python Training')
print(sentence)

['G', 'o', 'o', 'd', ' ', 'm', 'o', 'r', 'n', 'i', 'n', 'g', ' ', 'W', 'e', 'l', 'c', 'o', 'm', 'e', ' ', 't', 'o', ' ', 'P', 'y', 't', 'h', 'o', 'n', ' ', 'T', 'r', 'a', 'i', 'n', 'i', 'n', 'g']

In [123]:
obj = pd.Series(sentence)
print(obj)

0     G
1     o
2     o
3     d
4
5     m
6     o
7     r
8     n
9     i
10    n
11    g
12
13    W
14    e
15    l
16    c
17    o
18    m
19    e
20
21    t
22    o
23
24    P
25    y
26    t
27    h
28    o
29    n
30
31    T
32    r
33    a
34    i
35    n
36    i
37    n
38    g
dtype: object

In [124]:
obj.describe()

count     39
unique    19
top        o
freq       6
dtype: object

In [125]:
obj.unique()

array(['G', 'o', 'd', ' ', 'm', 'r', 'n', 'i', 'g', 'W', 'e', 'l', 'c',
       't', 'P', 'y', 'h', 'T', 'a'], dtype=object)

In [126]:
obj.tail()

34    i
35    n
36    i
37    n
38    g
dtype: object

In [127]:
obj.head()

0    G
1    o
2    o
3    d
4
dtype: object

In [128]:
obj.head(10)

0    G
1    o
2    o
3    d
4
5    m
6    o
7    r
8    n
9    i
dtype: object

In [129]:
obj = pd.Series([0.1,0.25,0.5,0.7,0.75,1])

In [130]:
obj.all()

True

In [131]:
obj.any()

True

In [132]:
(obj > 0.5).all()

False

In [133]:
(obj>0.5).any()

True

In [134]:
obj = pd.Series([0,0.25,0.5,0.75,1])
obj.all()

False

In [136]:
obj = pd.Series([0.1,0.25,0.5,0.7,0.75,1])
(obj+obj).equals(obj)

False

In [138]:
(obj+obj).equals(obj*2)

True

In [140]:
(obj+obj) == (obj*2)

0    True
1    True
2    True
3    True
4    True
5    True
dtype: bool

In [141]:
((obj+obj) == (obj*2)).all()

True

In [145]:
data = {'col0':[3,2,2,1],'col1':[85,92,89,95],'col2':['B','A','B','A']}
df = pd.DataFrame(data)
df

   col0  col1 col2
0     3    85    B
1     2    92    A
2     2    89    B
3     1    95    A

In [148]:
df = pd.DataFrame()
df['col0'] = pd.Series([3,2,2,1])
print(df)

   col0
0     3
1     2
2     2
3     1

In [149]:
df['col1'] = pd.Series([85,92,89,95])
print(df)

   col0  col1
0     3    85
1     2    92
2     2    89
3     1    95

In [151]:
df['col2'] = pd.Series(['B','A','B','A'])
print(df)
print(type(df))
print(type(df['col0']))
print(type(df['col0'][2]))

   col0  col1 col2
0     3    85    B
1     2    92    A
2     2    89    B
3     1    95    A
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'numpy.int64'>

In [156]:
print(df.columns)
df.columns = ['column0','column1','column2']
print(df)

Index(['col0', 'col1', 'col2'], dtype='object')
   column0  column1 column2
0        3       85       B
1        2       92       A
2        2       89       B
3        1       95       A

In [157]:
df['column3'] = [1,2,3,4]
print(df)

   column0  column1 column2  column3
0        3       85       B        1
1        2       92       A        2
2        2       89       B        3
3        1       95       A        4

In [158]:
type(df['column3'])

pandas.core.series.Series

In [162]:
df['column4'] = (df['column0']*df['column1'])
print(df)

   column0  column1 column2  column3  column4
0        3       85       B        1      255
1        2       92       A        2      184
2        2       89       B        3      178
3        1       95       A        4       95

In [164]:
(df['column0'] * df['column1']).sum()

712

In [165]:
(df['column0'] * df['column1']).sum() / df['column0'].sum()

89.0

In [169]:
df = pd.DataFrame()
df['col0'] = pd.Series([3,2,2,1])
df['col1'] = pd.Series([85,92,89,95])
df['col2'] = pd.Series(['B','A','B','A'])
df.columns = ['column0','column1','column2']
df['column3'] = [1,2,3,4]
df['column4'] = (df['column0']*df['column1'])
print(df)

   column0  column1 column2  column3  column4
0        3       85       B        1      255
1        2       92       A        2      184
2        2       89       B        3      178
3        1       95       A        4       95

In [170]:
df.drop('column3',axis=1,inplace=True)
print(df)

   column0  column1 column2  column4
0        3       85       B      255
1        2       92       A      184
2        2       89       B      178
3        1       95       A       95

In [171]:
df.columns = ['time','score','grade','total']
print(df)

   time  score grade  total
0     3     85     B    255
1     2     92     A    184
2     2     89     B    178
3     1     95     A     95

In [172]:
df = pd.DataFrame()
df['time'] = pd.Series([3,2,2,1])
df['score'] = pd.Series([85,92,89,95])
df['grade'] = pd.Series(['B','A','B','A'])
df['total'] = (df['time']*df['score'])
print(df)

   time  score grade  total
0     3     85     B    255
1     2     92     A    184
2     2     89     B    178
3     1     95     A     95

In [173]:
index = ['수학','영어','사회','과학']
df.index = index
print(df)

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [174]:
df['time']

수학    3
영어    2
사회    2
과학    1
Name: time, dtype: int64

In [175]:
df[['time','score']]

    time  score
수학     3     85
영어     2     92
사회     2     89
과학     1     95

In [178]:
df[df.columns[0:3]]

    time  score grade
수학     3     85     B
영어     2     92     A
사회     2     89     B
과학     1     95     A

In [181]:
df.loc['수학']

time       3
score     85
grade      B
total    255
Name: 수학, dtype: object

In [182]:
df.loc['수학':'사회']

    time  score grade  total
수학     3     85     B    255
영어     2     92     A    184
사회     2     89     B    178

In [183]:
df.at['수학','score']

85

In [184]:
df.iat[0,1]

85

In [186]:
df.iat[0,1] = 74
print(df)

    time  score grade  total
수학     3     74     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [187]:
df.head(3)

    time  score grade  total
수학     3     74     B    255
영어     2     92     A    184
사회     2     89     B    178

In [188]:
df.tail()

    time  score grade  total
수학     3     74     B    255
영어     2     92     A    184
사회     2     89     B    178
과학     1     95     A     95

In [189]:
time = [3,2,2,1]
score = [85,92,89,95]
grade = ['B','A','B','A']
dataSet = list(zip(time,score,grade))
print(dataSet)

[(3, 85, 'B'), (2, 92, 'A'), (2, 89, 'B'), (1, 95, 'A')]

In [191]:
df = pd.DataFrame(dataSet,columns=['Time','Score','Grade'],index = ['수학','영어','사회','과학'])
print(df)

    Time  Score Grade
수학     3     85     B
영어     2     92     A
사회     2     89     B
과학     1     95     A

In [192]:
time = [3,2,2,1]
score = [85,92,89,95]
grade = ['B','A','B','A']
dic = {'time':time,'score':score,'grade':grade}
print(dic)

{'time': [3, 2, 2, 1], 'score': [85, 92, 89, 95], 'grade': ['B', 'A', 'B', 'A']}

In [193]:
df1 = pd.DataFrame(dic,index = ['수학','영어','사회','과학'])
print(df1)

    time  score grade
수학     3     85     B
영어     2     92     A
사회     2     89     B
과학     1     95     A

In [194]:
time_dic = {'수학':3,'영어':2,'사회':2,'과학':1}
score_dic = {'수학':85,'영어':92,'사회':89,'과학':95}
grade_dic = {'수학':'B','영어':'A','사회':'B','과학':'A'}
time = pd.Series(time_dic)
score = pd.Series(score_dic)
grade = pd.Series(grade_dic)
print(time)
print(score)
print(grade)

수학    3
영어    2
사회    2
과학    1
dtype: int64
수학    85
영어    92
사회    89
과학    95
dtype: int64
수학    B
영어    A
사회    B
과학    A
dtype: object

In [195]:
dataSet_dic = {'time':time,'score':score,'grade':grade}
print(dataSet_dic)

{'time': 수학    3
영어    2
사회    2
과학    1
dtype: int64, 'score': 수학    85
영어    92
사회    89
과학    95
dtype: int64, 'grade': 수학    B
영어    A
사회    B
과학    A
dtype: object}

In [196]:
df2 = pd.DataFrame(dataSet_dic)
print(df2)

    time  score grade
수학     3     85     B
영어     2     92     A
사회     2     89     B
과학     1     95     A

In [197]:
arrays = [['bar','bar','baz','baz','foo','foo','qux','qux'],
         ['one','two','one','two','one','two','one','two']]
tuples = list(zip(*arrays))
print(tuples)

[('bar', 'one'), ('bar', 'two'), ('baz', 'one'), ('baz', 'two'), ('foo', 'one'), ('foo', 'two'), ('qux', 'one'), ('qux', 'two')]

In [199]:
index = pd.MultiIndex.from_tuples(tuples, names = ['first','second'])
print(index)

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [201]:
iterables = [['bar','baz','foo','qux'],['one','two']]
pd.MultiIndex.from_product(iterables, names = ['first','second'])

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [202]:
type(index)

pandas.core.indexes.multi.MultiIndex

In [214]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [212]:
pd.Series(np.random.randn(8),index=index)

first  second
bar    one       0.575212
       two       0.579245
baz    one       0.625742
       two      -1.063179
foo    one      -1.494586
       two      -0.094169
qux    one      -1.687359
       two       1.178536
dtype: float64

In [215]:
pd.DataFrame(np.random.randn(8,4),index=index)

                     0         1         2         3
first second
bar   one    -1.789880 -0.271692 -0.563838 -1.953212
      two    -0.321943  0.250237 -0.071631 -0.053626
baz   one     1.396545 -0.006228  0.031101 -0.197533
      two     1.574598 -1.407285 -0.335384  1.003302
foo   one    -0.289468  2.769162  0.651682  0.731893
      two     0.854989 -0.157076 -0.476993  1.507106
qux   one     0.828002 -0.988958  1.081932 -0.644140
      two     1.210072 -0.088975  1.210869  0.516740

In [216]:
arrays = [np.array(['bar','bar','baz','baz','foo','foo','qux','qux']),
         np.array(['one','two','one','two','one','two','one','two'])]
print(arrays)

[array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
      dtype='<U3'), array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'],
      dtype='<U3')]

In [217]:
pd.Series(np.random.randn(8),index=arrays)

bar  one    1.109893
     two    0.917595
baz  one    0.429165
     two    0.071905
foo  one    0.818011
     two    1.186052
qux  one   -1.558650
     two    0.105181
dtype: float64

In [218]:
pd.DataFrame(np.random.randn(8,4),index=arrays)

                0         1         2         3
bar one -0.393629 -0.655674 -0.073586  0.017177
    two -0.104577  0.186709  1.265956  1.718702
baz one -0.896292  0.110246  1.140976 -1.179838
    two -0.735684 -0.675612  0.451757 -1.667492
foo one -1.424605 -1.093227 -0.195633 -0.412884
    two -1.322572  1.280570  0.004193  1.382928
qux one  0.281124 -0.615919 -1.075911  0.158026
    two -1.527227  1.338467 -0.955092  0.649173

In [219]:
pd.DataFrame(np.random.randn(4,8),columns=index)

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
0       1.066077  0.848402 -1.020480  0.072069 -0.081607  1.998151  1.032448
1       0.277230 -0.415031 -0.644121 -0.159489 -1.487994 -0.938895 -0.021761
2       0.596558  1.086952 -1.838381 -0.701763 -0.000766 -0.215693  0.676547
3       1.023136 -0.210785 -0.670300 -0.894441  0.463047 -1.030328 -0.276809

first
second       two
0      -0.929638
1      -0.557318
2      -0.218158
3      -0.573759

In [220]:
pd.DataFrame(np.random.randn(4,8),columns=arrays)

        bar                 baz                 foo                 qux  \
        one       two       one       two       one       two       one
0 -0.068086  0.406368 -0.211137 -1.759113  0.386738  0.632490  0.573468
1  0.673967 -0.784689 -1.010512 -1.485493  1.228581 -0.907879 -1.061549
2 -0.868725 -0.479670  0.151931  0.576865 -0.464603  0.613750  0.444057
3 -0.173590 -2.598433  0.374385  1.096273 -0.533318  0.079413  0.831293


        two
0  1.649529
1  0.474804
2 -0.418551
3  0.424369

In [223]:
pd.DataFrame(np.random.randn(8,4),index=index).T

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
0      -0.571542 -0.729638 -0.442994  0.638342  1.120596 -0.405133 -0.174839
1       1.058824 -0.624767  0.780157 -0.777923  0.729221  0.468265 -0.651086
2       1.414129  0.547749 -0.405241  0.670286  0.162465 -0.299491 -1.092692
3       0.300380 -0.278491  2.093443 -0.986978  0.184124  0.487356  1.311238

first
second       two
0      -2.892959
1      -1.953467
2      -1.088734
3       0.229170

In [231]:
df = pd.DataFrame(np.random.randn(4,8),columns=arrays)
print(df)

        bar                 baz                 foo                 qux  \
        one       two       one       two       one       two       one
0 -0.532943 -0.381445 -0.439391  0.965391  0.884145  0.661651 -0.405437
1 -0.242749 -0.158236 -0.389309 -0.508362 -1.131721 -1.030891  0.309454
2 -0.282582  1.265653  0.237184 -1.800523 -0.377608 -0.492720 -0.588148
3  0.950133  2.094158 -1.585262 -0.352613 -0.883129 -0.201955 -0.377924


        two
0  0.895849
1  0.014238
2  1.540390
3 -0.361290

In [225]:
df['bar']

        one       two
0  0.086996 -0.301710
1  0.241286 -0.242930
2  0.579232  1.098759
3  0.595046  0.330560

In [227]:
df['bar','one']

0    0.086996
1    0.241286
2    0.579232
3    0.595046
Name: (bar, one), dtype: float64

In [228]:
df['bar']['one']

0    0.086996
1    0.241286
2    0.579232
3    0.595046
Name: one, dtype: float64

In [232]:
df = df.T
print(df)

                0         1         2         3
bar one -0.532943 -0.242749 -0.282582  0.950133
    two -0.381445 -0.158236  1.265653  2.094158
baz one -0.439391 -0.389309  0.237184 -1.585262
    two  0.965391 -0.508362 -1.800523 -0.352613
foo one  0.884145 -1.131721 -0.377608 -0.883129
    two  0.661651 -1.030891 -0.492720 -0.201955
qux one -0.405437  0.309454 -0.588148 -0.377924
    two  0.895849  0.014238  1.540390 -0.361290

In [233]:
df.loc['baz':'foo']

                0         1         2         3
baz one -0.439391 -0.389309  0.237184 -1.585262
    two  0.965391 -0.508362 -1.800523 -0.352613
foo one  0.884145 -1.131721 -0.377608 -0.883129
    two  0.661651 -1.030891 -0.492720 -0.201955

In [235]:
df.iloc[3:5]

                0         1         2         3
baz two  0.965391 -0.508362 -1.800523 -0.352613
foo one  0.884145 -1.131721 -0.377608 -0.883129

In [236]:
df.loc[('bar','two'),]

0   -0.381445
1   -0.158236
2    1.265653
3    2.094158
Name: (bar, two), dtype: float64

In [238]:
df.loc[('bar','two'),0]

-0.3814445279854343

In [239]:
df.iloc[1,0]

-0.3814445279854343

In [240]:
df.loc[('bar','one'):('baz','one'),1:2]

                1         2
bar one -0.242749 -0.282582
    two -0.158236  1.265653
baz one -0.389309  0.237184

In [241]:
df.iloc[0:3,1:3]

                1         2
bar one -0.242749 -0.282582
    two -0.158236  1.265653
baz one -0.389309  0.237184

In [244]:
df.loc['baz':'foo']

                0         1         2         3
baz one -0.439391 -0.389309  0.237184 -1.585262
    two  0.965391 -0.508362 -1.800523 -0.352613
foo one  0.884145 -1.131721 -0.377608 -0.883129
    two  0.661651 -1.030891 -0.492720 -0.201955

In [245]:
df.loc[('baz','two'):('foo','one')]

                0         1         2         3
baz two  0.965391 -0.508362 -1.800523 -0.352613
foo one  0.884145 -1.131721 -0.377608 -0.883129

In [247]:
df.iloc[3:5]

                0         1         2         3
baz two  0.965391 -0.508362 -1.800523 -0.352613
foo one  0.884145 -1.131721 -0.377608 -0.883129

In [249]:
df.loc[:,1:3]

                1         2         3
bar one -0.242749 -0.282582  0.950133
    two -0.158236  1.265653  2.094158
baz one -0.389309  0.237184 -1.585262
    two -0.508362 -1.800523 -0.352613
foo one -1.131721 -0.377608 -0.883129
    two -1.030891 -0.492720 -0.201955
qux one  0.309454 -0.588148 -0.377924
    two  0.014238  1.540390 -0.361290

In [251]:
df.iloc[:,1:3]

                1         2
bar one -0.242749 -0.282582
    two -0.158236  1.265653
baz one -0.389309  0.237184
    two -0.508362 -1.800523
foo one -1.131721 -0.377608
    two -1.030891 -0.492720
qux one  0.309454 -0.588148
    two  0.014238  1.540390

In [253]:
df.iat[0,1]

-0.24274911315880018

In [254]:
df.iat[0,3]

0.9501325353879793

In [255]:
df.iat[3,3]

-0.35261283647426445

In [256]:
df.at[('bar','one'),3]

0.9501325353879793

In [257]:
df.at[('qux','two'),3]

-0.3612903045414992

In [258]:
df[0].sum()

1.6478193387372184

In [262]:
df[0].loc['bar','one'] = '1'
print(df[0])

bar  one           1
     two   -0.381445
baz  one   -0.439391
     two    0.965391
foo  one    0.884145
     two    0.661651
qux  one   -0.405437
     two    0.895849
Name: 0, dtype: object

In [263]:
df[0].loc['bar','one']

'1'

In [264]:
type(df[0].loc['bar','one'])

str

In [265]:
type(df[0].loc['bar','two'])

float

In [267]:
type(df[0])

pandas.core.series.Series

In [269]:
df.sum()

1   -3.137575
2   -0.498353
3   -0.717883
dtype: float64

In [270]:
arrays = {'first':['bar','bar','baz','baz','foo','foo','qux','qux'],
         'second':['one','two','one','two','one','two','one','two'],
         'A':np.random.randn(8),
         'B':np.random.randn(8),
         'C':np.random.randn(8),
         'D':np.random.randn(8)}
df = pd.DataFrame(arrays)
df

  first second         A         B         C         D
0   bar    one -0.962602 -0.358377  0.062026 -2.979470
1   bar    two  0.377912 -0.365788 -0.147374 -1.400428
2   baz    one  1.320283  0.037299 -1.407893 -0.470541
3   baz    two -0.982055  0.080801 -0.958749  0.099645
4   foo    one -0.213562  2.042581  1.278763 -0.780963
5   foo    two -1.272787 -1.142685  1.395736  0.118954
6   qux    one -1.100862 -0.789650  0.522914 -1.793833
7   qux    two  0.330711  1.255586 -0.918952  0.777327

In [271]:
df.groupby('second').sum()

               A         B        C         D
second
one    -0.956743  0.931853  0.45581 -6.024807
two    -1.546218 -0.172087 -0.62934 -0.404502

In [272]:
df.groupby('second').sum().index

Index(['one', 'two'], dtype='object', name='second')

In [274]:
df.groupby(['first','second']).sum()

                     A         B         C         D
first second
bar   one    -0.962602 -0.358377  0.062026 -2.979470
      two     0.377912 -0.365788 -0.147374 -1.400428
baz   one     1.320283  0.037299 -1.407893 -0.470541
      two    -0.982055  0.080801 -0.958749  0.099645
foo   one    -0.213562  2.042581  1.278763 -0.780963
      two    -1.272787 -1.142685  1.395736  0.118954
qux   one    -1.100862 -0.789650  0.522914 -1.793833
      two     0.330711  1.255586 -0.918952  0.777327

In [275]:
df.groupby('first').sum()

              A         B         C         D
first
bar   -0.584690 -0.724165 -0.085349 -4.379898
baz    0.338229  0.118100 -2.366642 -0.370896
foo   -1.486349  0.899895  2.674499 -0.662009
qux   -0.770151  0.465936 -0.396038 -1.016506

In [276]:
type(df.groupby('first').sum())

pandas.core.frame.DataFrame

In [277]:
df.groupby('first').sum()['A']

first
bar   -0.584690
baz    0.338229
foo   -1.486349
qux   -0.770151
Name: A, dtype: float64

In [278]:
df.groupby('first').sum().loc['bar']

A   -0.584690
B   -0.724165
C   -0.085349
D   -4.379898
Name: bar, dtype: float64

In [279]:
df.groupby('first',as_index=False).sum()

  first         A         B         C         D
0   bar -0.584690 -0.724165 -0.085349 -4.379898
1   baz  0.338229  0.118100 -2.366642 -0.370896
2   foo -1.486349  0.899895  2.674499 -0.662009
3   qux -0.770151  0.465936 -0.396038 -1.016506

In [281]:
df.groupby('first',as_index=False).sum().iloc[0]

first          bar
A         -0.58469
B        -0.724165
C       -0.0853488
D          -4.3799
Name: 0, dtype: object

In [ ]:
df.groupby('first',as_index=False).sum().iloc['bar']

In [294]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3'],},
                   index = [0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7'],},
                   index = [4,5,6,7])
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11'],},
                   index = [8,9,10,11])
frames = [df1,df2,df3]
print(df1)
print(df2)
print(df3)
print(frames)
pd.concat(frames)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
[    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3,     A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7,       A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11]

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [295]:
result = pd.concat(frames, keys=['x','y','z'])
print(result)

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [296]:
result.loc['y']

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [299]:
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                    'D':['D2','D3','D6','D7'],
                    'F':['F2','F3','F6','F7']},
                    index = [2,3,6,7])
print(df1)
print(df4)
pd.concat([df1,df4],axis=1,sort=False)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [300]:
pd.concat([df1,df4],axis=1,join='inner')

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [302]:
s1 = pd.Series(['X0','X1','X2','X3'], name='X')
print(df1)
print(s1)
pd.concat([df1,s1],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0    X0
1    X1
2    X2
3    X3
Name: X, dtype: object

    A   B   C   D   X
0  A0  B0  C0  D0  X0
1  A1  B1  C1  D1  X1
2  A2  B2  C2  D2  X2
3  A3  B3  C3  D3  X3

In [303]:
print(df1)
print(df2)
df1.append(df2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [306]:
df1.append([df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [308]:
print(df1)
print(df4)
df1.append(df4)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [309]:
df1.append(df4, ignore_index=True)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [313]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})
print(left)
print(right)
pd.merge(left,right,on='key')

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [315]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                     'key2':['K0','K1','K0','K1'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})

right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                     'key2':['K0','K0','K0','K0'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})
print(left)
print(right)
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [317]:
print(left)
print(right)
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [318]:
print(left)
print(right)
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [319]:
print(left)
print(right)
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [320]:
print(left)
print(right)
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [321]:
left = pd.DataFrame({'A':[1,2],'B':[1,2]})
right = pd.DataFrame({'A':[4,5,6],'B':[2,2,2]})
print(left)
print(right)
pd.merge(left,right, on='B',how='outer',validate='one_to_many')

   A  B
0  1  1
1  2  2
   A  B
0  4  2
1  5  2
2  6  2

   A_x  B  A_y
0    1  1  NaN
1    2  2  4.0
2    2  2  5.0
3    2  2  6.0

In [323]:
pd.merge(left,right, on='B',how='outer',indicator=True)

   A_x  B  A_y     _merge
0    1  1  NaN  left_only
1    2  2  4.0       both
2    2  2  5.0       both
3    2  2  6.0       both

In [324]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                     'B':['B0','B1','B2']},
                   index = ['K0','K1','K2'])
right = pd.DataFrame({'C':['C0','C1','C2'],
                     'D':['D0','D1','D2']},
                   index = ['K0','K2','K3'])
print(left)
print(right)
left.join(right)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [325]:
print(left)
print(right)
left.join(right,how='outer')

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [326]:
pd.merge(left,right,how='outer',left_index=True,right_index=True)

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [333]:
left = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3'],
                    'key1':['K0','K0','K1','K1'],
                    'key2':['K0','K1','K0','K1']})

index = pd.MultiIndex.from_tuples([('K0','K0'),('K1','K0'),
                                 ('K2','K0'),('K2','K1')])
right = pd.DataFrame({'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']},
                    index = index)

print(left)
print(right)
print(index)
left.join(right,on=['key1','key2'])

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K1   K1
        C   D
K0 K0  C0  D0
K1 K0  C1  D1
K2 K0  C2  D2
   K1  C3  D3
MultiIndex([('K0', 'K0'),
            ('K1', 'K0'),
            ('K2', 'K0'),
            ('K2', 'K1')],
           )

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A3  B3   K1   K1  NaN  NaN

In [334]:
left.join(right,on=['key1','key2'],how='inner')

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
2  A2  B2   K1   K0  C1  D1